Tekla Open API Reference for Tekla Structures 2025
InvalidRadiusException Constructor
 Initializes a new instance of the InvalidRadiusException class with "Cannot connect parts with a cylindrical section having the provided radius" error message.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public InvalidRadiusException()
Public Sub New
See Also
Reference
InvalidRadiusException Class
Tekla.Structures.Model Namespace